#include<pmon.h>
#include<asm.h>
#include<machine/types.h>
#include<linux/mtd/mtd.h>
#include<linux/mtd/nand.h>
#include<linux/mtd/partitions.h>
#include<sys/malloc.h>
#include <linux/mtd/nand_bch.h>
#include <nand_bch.h>

#ifndef __iomem
#define __iomem
#endif

#define LS1X_DMA_ACCESS_ADDR     0x1fe78040
#define LS1X_ORDER_REG_ADDR      (0xbfd01160)
#define LS1X_NAND_REG_BASE      (0xbfe78000)
#define MAX_BUFF_SIZE	4096
#define PAGE_SHIFT      12
#ifdef LS1GSOC
#define NO_SPARE_ADDRH(x)   ((x) >> (32 - (PAGE_SHIFT - 1 )))   
#define NO_SPARE_ADDRL(x)   ((x) << (PAGE_SHIFT - 1))
#define SPARE_ADDRH(x)      ((x) >> (32 - (PAGE_SHIFT )))   
#define SPARE_ADDRL(x)      ((x) << (PAGE_SHIFT ))
#elif (defined LS1FSOC|| defined LS1CSOC)
#define NO_SPARE_ADDRH(x)   (x)   
#define NO_SPARE_ADDRL(x)   0
#define SPARE_ADDRH(x)      (x)   
#define SPARE_ADDRL(x)      0
#endif

#define ALIGN_DMA(x)       (((x)+ 3)/4)
#define CHIP_DELAY_TIMEOUT (2*HZ/10)

#define STATUS_TIME_LOOP_R  100 
#define STATUS_TIME_LOOP_WS  300  
#define STATUS_TIME_LOOP_WM  60 
#define STATUS_TIME_LOOP_E   100 
#define NAND_CMD        0x1
#define NAND_ADDRL      0x2
#define NAND_ADDRH      0x4
#define NAND_TIMING     0x8
#define NAND_IDL        0x10
#define NAND_STATUS_IDL 0x20
#define NAND_PARAM      0x40
#define NAND_OP_NUM     0X80
#define NAND_CS_RDY_MAP 0x100

#define DMA_ORDERAD     0x1
#define DMA_SADDR       0x2
#define DMA_DADDR       0x4
#define DMA_LENGTH      0x8
#define DMA_STEP_LENGTH 0x10
#define DMA_STEP_TIMES  0x20
#define DMA_CMD         0x40

#if defined LS1FSOC|| defined LS1CSOC
#define NAND_ECC_OFF    0
#define NAND_ECC_ON     1
#define RAM_OP_OFF      0
#define RAM_OP_ON       1
#endif

enum{
    ERR_NONE        = 0,
    ERR_DMABUSERR   = -1,
    ERR_SENDCMD     = -2,
    ERR_DBERR       = -3,
    ERR_BBERR       = -4,
};
enum{
    STATE_READY = 0,
    STATE_BUSY  ,
};

struct ls1g_nand_platform_data{
        int enable_arbiter;
        struct mtd_partition *parts;
        unsigned int nr_parts;
};
struct ls1g_nand_cmdset {
        uint32_t    cmd_valid:1;    //0
    	uint32_t    read:1;         //1
	uint32_t    write:1;        //2
	uint32_t    erase_one:1;    //3
    	uint32_t    erase_con:1;    //4
	uint32_t    read_id:1;      //5
	uint32_t    reset:1;        //6
	uint32_t    read_sr:1;      //7
	uint32_t    op_main:1;      //8
	uint32_t    op_spare:1;     //9
	uint32_t    done:1;         //10
//#ifdef  LS1FSOC||LS1CSOC
#if defined LS1FSOC|| defined LS1CSOC
        uint32_t    ecc_rd:1;         //11
	uint32_t    ecc_wr:1;         //12
	uint32_t    int_en:1;         //13
        uint32_t    resv14:1;         //14
	uint32_t    ram_op:1;         //15
#elif LS1GSOC
        uint32_t    resv1:5;//11-15 reserved
#endif        
        uint32_t    nand_rdy:4;//16-19
        uint32_t    nand_ce:4;//20-23
//#ifdef LS1FSOC||LS1CSOC
#if defined LS1FSOC|| defined LS1CSOC
	uint32_t    ecc_dma_req:1;         //24
	uint32_t    nul_dma_req:1;         //25
#endif        
        uint32_t    resv26:8;//26-31 reserved
};
struct ls1g_nand_dma_desc{
        uint32_t    orderad;
        uint32_t    saddr;
        uint32_t    daddr;
        uint32_t    length;
        uint32_t    step_length;
        uint32_t    step_times;
        uint32_t    cmd;
};
struct ls1g_nand_dma_cmd{
        uint32_t    dma_int_mask:1;
        uint32_t    dma_int:1;
        uint32_t    dma_sl_tran_over:1;
        uint32_t    dma_tran_over:1;
        uint32_t    dma_r_state:4;
        uint32_t    dma_w_state:4;
        uint32_t    dma_r_w:1;
        uint32_t    dma_cmd:2;
        uint32_t    revl:17;
};
struct ls1g_nand_desc{
        uint32_t    cmd;
        uint32_t    addrl;
        uint32_t    addrh;
        uint32_t    timing;
        uint32_t    idl;//readonly
        uint32_t    status_idh;//readonly
        uint32_t    param;
        uint32_t    op_num;
        uint32_t    cs_rdy_map;
};
struct ls1g_nand_info {
